nahucvc/Tejada/STM32G431/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define adelante_Pin GPIO_PIN_1
#define adelante_GPIO_Port GPIOA
#define atraz_Pin GPIO_PIN_2
#define atraz_GPIO_Port GPIOA
#define enable_Pin GPIO_PIN_5
#define enable_GPIO_Port GPIOA
#define C_Pin GPIO_PIN_15
#define C_GPIO_Port GPIOA
#define D_Pin GPIO_PIN_10
#define D_GPIO_Port GPIOC
#define E_Pin GPIO_PIN_11
#define E_GPIO_Port GPIOC
#define F_Pin GPIO_PIN_3
#define F_GPIO_Port GPIOB
#define G_Pin GPIO_PIN_4
#define G_GPIO_Port GPIOB
#define H_Pin GPIO_PIN_5
#define H_GPIO_Port GPIOB
#define I_Pin GPIO_PIN_6
#define I_GPIO_Port GPIOB
#define J_Pin GPIO_PIN_7
#define J_GPIO_Port GPIOB
#define K_Pin GPIO_PIN_9
#define K_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
